---
kind: method
id: M:Autodesk.Revit.UI.Events.FabricationPartBrowserChangedEventArgs.GetCurrentSolutionPartTypeIds
source: html/020246db-4c1c-e3d5-9f5f-ca1f5ad40974.htm
---
# Autodesk.Revit.UI.Events.FabricationPartBrowserChangedEventArgs.GetCurrentSolutionPartTypeIds Method

Returns set of fabrication part types that are used in the currently selected solution.

## Syntax (C#)
```csharp
public ISet<ElementId> GetCurrentSolutionPartTypeIds()
```

## Returns
The set of ElementIds.